<template lang="pug">
    include ../../../../tools/mixins.pug
    div
         header-component(
             :color="'white'"
         )
         #pinContainer(ref="wrapper")
             .shadow-background
             article-component#article-0(
                 ref="article0"
                 :content="content.article"
             )
              // div(
              //     v-for="(article, index) in articles"
              //     :id="'article-'+index"
              //     v-if="index >= 1"
              // )
              //     title-component(
              //         v-if="!windowMobile && index !== 0 && articleCount >= index"
              //         :textMobile="textDesktop"
              //         :textDesktop="textDesktop"
              //         :fontSize="'small'"
              //     )
              //     article-component(
              //         ref="articles"
              //         v-if="articleCount >= index"
              //         :content="article.content"
              //     )
         footer-component
</template>

<script>
    import constants from '../../../../../content/constants.json';

    import Header from '../../../sections/Header.vue';
    import Article from '../../../sections/Article.vue';
    import Footer from '../../../sections/Footer.vue';
    import Title from '../../../blanks/Title.vue';
    import {getScroll} from '../../../../mixins/frontEnd/utility/getScroll.js';

    export default {
        props: ['content'],
        mixins: [getScroll],
        data() {
            return {
                magicScroll: {
                    controller: null,
                    scene: null,
                    init: false,
                },
                articlesHeight: 0,
                articleCount: 1,
                windowMobile: false,
                textMobile: 'Следующая статья',
                textDesktop: 'Следующая статья',
                articles: [
                    {
                        content: {
                            title: 'Какой шезлонг выбрать?',
                            background: '/public/media/img/article/main.jpg',
                            text: '<i>Выбор подходящего шезлонга весьма ответственная задача. При нынешнем изобилии формфакторов и конструкций достаточно сложно подобрать идеально подходящий вашей фигуре и виду отдыха вариант. За помощью мы обратились к нашему мастеру пляжных дел, господину Чонгуку.</i>' +
                                '<h2>Правила хорошего шезлонга</h2>' +
                                '<p>Товарищи! сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.</p>' +
                                '<p>Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h2>«Выбирайте каркасс из пальмовой древесины»</h2>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<h2>Виды шезлонга</h2>' +
                                '<ul class="images">' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul1.jpg">' +
                                '<b>Деревяный</b>' +
                                '</li>' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul2.jpg">' +
                                '<b>Стекляный</b>' +
                                '</li>' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul3.jpg">' +
                                '<b>Фарфоровый</b>' +
                                '</li>' +
                                '</ul>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h3>Заголовок маленький перед фотографией</h3>' +
                                '<div class="text__image">' +
                                '<img src="/public/media/img/article/image1.jpg">' +
                                '</div>' +
                                '<span>Для вечерних посиделок лучше всего подходит синтетический шезлонг</span>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<h4>Синтетика или натуральная ткань?</h4>' +
                                '<p>Товарищи! сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации. Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h2>«Выбирайте каркасс из пальмовой древесины»</h2>' +
                                '<ul>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка</li>' +
                                '<li>Мы добавили еще новый пункт, и этот уж точно намного больше предыдущего</li>' +
                                '<li>Элемент списка</li>' +
                                '</ul>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации. Если вот мы вот так сделаем, то:</p>' +
                                '<ol>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка' +
                                '<ol>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка</li>' +
                                '</ol>' +
                                '</li>' +
                                '<li>Новый элемент списка</li>' +
                                '</ol>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<ul class="list">' +
                                '<li>' +
                                '<b>Деревяный</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '<li>' +
                                '<b class="bold">Стекляный</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '<li>' +
                                '<b class="bold">Фарфоровый</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '</ul>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<div class="text__photos swiper-container">' +
                                '<div class="swiper-wrapper">' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image1.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image2.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image1.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image2.jpg"></div>' +
                                '</div>' +
                                '<div class="text__count"></div>' +
                                '<div class="text__buttons">' +
                                '<div class="text__button text__button--prev button button--nav"></div>' +
                                '<div class="text__button text__button--next button button--nav"></div>' +
                                '</div>' +
                                '</div>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p><b>Внимание.</b> сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации. Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>'
                        }
                    },
                    {
                        content: {
                            title: 'Какой шезлонг выбрать?',
                            background: '/public/media/img/article/main.jpg',
                            text: '<i>Выбор подходящего шезлонга весьма ответственная задача. При нынешнем изобилии формфакторов и конструкций достаточно сложно подобрать идеально подходящий вашей фигуре и виду отдыха вариант. За помощью мы обратились к нашему мастеру пляжных дел, господину Чонгуку.</i>' +
                                '<h2>Правила хорошего шезлонга</h2>' +
                                '<p>Товарищи! сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.</p>' +
                                '<p>Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h2>«Выбирайте каркасс из пальмовой древесины»</h2>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<h2>Виды шезлонга</h2>' +
                                '<ul class="images">' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul1.jpg">' +
                                '<b>Деревяный</b>' +
                                '</li>' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul2.jpg">' +
                                '<b>Стекляный</b>' +
                                '</li>' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul3.jpg">' +
                                '<b>Фарфоровый</b>' +
                                '</li>' +
                                '</ul>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h3>Заголовок маленький перед фотографией</h3>' +
                                '<div class="text__image">' +
                                '<img src="/public/media/img/article/image1.jpg">' +
                                '</div>' +
                                '<span>Для вечерних посиделок лучше всего подходит синтетический шезлонг</span>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<h4>Синтетика или натуральная ткань?</h4>' +
                                '<p>Товарищи! сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации. Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h2>«Выбирайте каркасс из пальмовой древесины»</h2>' +
                                '<ul>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка</li>' +
                                '<li>Мы добавили еще новый пункт, и этот уж точно намного больше предыдущего</li>' +
                                '<li>Элемент списка</li>' +
                                '</ul>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации. Если вот мы вот так сделаем, то:</p>' +
                                '<ol>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка' +
                                '<ol>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка</li>' +
                                '</ol>' +
                                '</li>' +
                                '<li>Новый элемент списка</li>' +
                                '</ol>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<ul class="list">' +
                                '<li>' +
                                '<b>Деревяный</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '<li>' +
                                '<b class="bold">Стекляный</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '<li>' +
                                '<b class="bold">Фарфоровый</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '</ul>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<div class="text__photos swiper-container">' +
                                '<div class="swiper-wrapper">' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image1.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image2.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image1.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image2.jpg"></div>' +
                                '</div>' +
                                '<div class="text__count"></div>' +
                                '<div class="text__buttons">' +
                                '<div class="text__button text__button--prev button button--nav"></div>' +
                                '<div class="text__button text__button--next button button--nav"></div>' +
                                '</div>' +
                                '</div>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p><b>Внимание.</b> сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации. Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>'
                        }
                    },
                    {
                        content: {
                            title: 'Какой шезлонг выбрать?',
                            background: '/public/media/img/article/main.jpg',
                            text: '<i>Выбор подходящего шезлонга весьма ответственная задача. При нынешнем изобилии формфакторов и конструкций достаточно сложно подобрать идеально подходящий вашей фигуре и виду отдыха вариант. За помощью мы обратились к нашему мастеру пляжных дел, господину Чонгуку.</i>' +
                                '<h2>Правила хорошего шезлонга</h2>' +
                                '<p>Товарищи! сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации.</p>' +
                                '<p>Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h2>«Выбирайте каркасс из пальмовой древесины»</h2>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<h2>Виды шезлонга</h2>' +
                                '<ul class="images">' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul1.jpg">' +
                                '<b>Деревяный</b>' +
                                '</li>' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul2.jpg">' +
                                '<b>Стекляный</b>' +
                                '</li>' +
                                '<li>' +
                                '<img src="/public/media/img/article/ul3.jpg">' +
                                '<b>Фарфоровый</b>' +
                                '</li>' +
                                '</ul>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h3>Заголовок маленький перед фотографией</h3>' +
                                '<div class="text__image">' +
                                '<img src="/public/media/img/article/image1.jpg">' +
                                '</div>' +
                                '<span>Для вечерних посиделок лучше всего подходит синтетический шезлонг</span>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения кадров позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<h4>Синтетика или натуральная ткань?</h4>' +
                                '<p>Товарищи! сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации. Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>' +
                                '<h2>«Выбирайте каркасс из пальмовой древесины»</h2>' +
                                '<ul>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка</li>' +
                                '<li>Мы добавили еще новый пункт, и этот уж точно намного больше предыдущего</li>' +
                                '<li>Элемент списка</li>' +
                                '</ul>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации. Если вот мы вот так сделаем, то:</p>' +
                                '<ol>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка' +
                                '<ol>' +
                                '<li>Элемент списка</li>' +
                                '<li>Новый элемент списка</li>' +
                                '</ol>' +
                                '</li>' +
                                '<li>Новый элемент списка</li>' +
                                '</ol>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<ul class="list">' +
                                '<li>' +
                                '<b>Деревяный</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '<li>' +
                                '<b class="bold">Стекляный</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '<li>' +
                                '<b class="bold">Фарфоровый</b>' +
                                '<p>Разнообразный и богатый опыт рамки и место обучения</p>' +
                                '</li>' +
                                '</ul>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<div class="text__photos swiper-container">' +
                                '<div class="swiper-wrapper">' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image1.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image2.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image1.jpg"></div>' +
                                '<div class="text__photo swiper-slide"><img src="/public/media/img/article/image2.jpg"></div>' +
                                '</div>' +
                                '<div class="text__count"></div>' +
                                '<div class="text__buttons">' +
                                '<div class="text__button text__button--prev button button--nav"></div>' +
                                '<div class="text__button text__button--next button button--nav"></div>' +
                                '</div>' +
                                '</div>' +
                                '<p>Идейные соображения высшего порядка, а также укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.</p>' +
                                '<p><b>Внимание.</b> сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании соответствующий условий активизации. Не следует, однако забывать, что укрепление и развитие структуры способствует подготовки и реализации дальнейших направлений развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке модели развития. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>'
                        }
                    }
                ],
            };
        },
        mounted(){
            console.log(this.content)
            // if(this.windowMobile){
            //     this.articleCount = 0;
            // }
            // if(window.innerWidth >= 1200){
            //     setTimeout(()=>{
            //         this.initScrollMagic();
            //     },100)
            // } else {
            //     this.display.height.last = window.innerHeight;
            //     window.addEventListener('resize', this.onResize);
            // }
            // document.addEventListener('scroll', this.onScroll);
        },
        destroyed(){
            document.removeEventListener('scroll', this.onScroll);
        },
        methods: {
            onResize(){
                if(this.display.height.last < window.innerHeight && !this.magicScroll.init){
                    this.magicScroll.init = true;
                    setTimeout(()=>{
                        this.initScrollMagic();
                    },100)
                }
            },
            initScrollMagic(){
                if(window.innerWidth >= 1200){
                    let offset = 0;
                    if(this.$refs.article0.$el.getBoundingClientRect().height > window.innerHeight){
                        offset = this.$refs.article0.$el.getBoundingClientRect().height - window.innerHeight;
                    } else {
                        offset= 0;
                    }

                    this.magicScroll.controller = new window.ScrollMagic.Controller();

                    let wipeAnimation = new TimelineMax();
                    wipeAnimation.add('step0')
                        .fromTo(`#article-1`, 1, {y: '0'}, {y: "-100%", ease: Linear.easeNone})
                        .fromTo(".shadow-background", 0.1, {opacity: '0'}, {opacity: "0.8", ease: Linear.easeNone},{timeScale:0.5})

                    this.magicScroll.scene = new window.ScrollMagic.Scene({
                        triggerElement: "#pinContainer",
                        triggerHook: "0",
                        duration: "600%",
                        offset: offset
                    })
                        .setPin("#pinContainer")
                        .setTween(wipeAnimation)
                        .addTo(this.magicScroll.controller)

                }
            },
            onScroll(){
//                this.onWrapperScroll();
            },
            onWrapperScroll(){
                if(this.articleCount < this.articles.length && window.innerWidth >= 1200){
                    let rectWrapper = this.$refs.wrapper.getBoundingClientRect(),
                        rectArticles = this.$refs.articles[this.articleCount - 1].$el.getBoundingClientRect();
                    if(this.getScroll().y >= rectWrapper.height - (rectArticles.height*0.2)){
                        this.articleCount++;
                    }
                }
            },
            checkWindowSize(){
                if(window.innerWidth >= 1200){
                    this.windowMobile = false;
                }   else {
                    this.windowMobile = true;
                }
            },
        },
        components: {
            'header-component': Header,
            'article-component': Article,
            'footer-component': Footer,
            'title-component': Title
        }
    };
</script>
